zahidul3/athan-clock/BOOSTXL-K350QVG-S1_GrlibExample_MSP432P401R/main.c
    if(status & EUSCI_A_UART_RECEIVE_INTERRUPT_FLAG)
    {
        if(UartLcdState <= UART_FINISH_ATHAN_TIME)
            index = 0;

        rxBuffer[index] = MAP_UART_receiveData(EUSCI_A2_BASE);
        if(rxBuffer[index] == CURRENT_TIME && UartLcdState <= UART_FINISH_ATHAN_TIME && index == 0)
            UartLcdState = UART_RECEIVING_CURRENT_TIME;
        else if(rxBuffer[index] == FAJR && index == 0)
            UartLcdState = UART_RECEIVING_ATHAN_TIME;

        index++;

        if(index >= sizeof(TsCurrentTime) && UartLcdState == UART_RECEIVING_CURRENT_TIME)
        {
            CurrentHour = rxBuffer[1];
            CurrentMinute = rxBuffer[2];

            memset(buffer, 0, DEBUG_BUFFER_SIZE);
            ltoa(CurrentHour,buffer);
            uint8_t strLen = strlen(buffer);
            buffer[strLen] = ':';
            ltoa(CurrentMinute,(buffer+strLen+1));
            printDebugString("Received current time: ");
            printDebugString(buffer);
            printDebugString("\n\r");

            //setCurrentTime12Hr(currentDateTime);
            drawMainMenu();
            UartLcdState = UART_FINISH_CURRENT_TIME;
            index = 0;
            //memcpy(&currentAthanTimesDay.athanTimes[0].athanType, rxBuffer, sizeof(currentAthanTimesDay));
        }

        if(index >= sizeof(currentAthanTimesDay) && UartLcdState == UART_RECEIVING_ATHAN_TIME) //18
        {
            memcpy(&currentAthanTimesDay.athanTimes[0].athanType, rxBuffer, sizeof(currentAthanTimesDay));
            g_ranDemo = true;
            printDebugString("Received athan time\n\r");
            drawMainMenu();
            UartLcdState = UART_FINISH_ATHAN_TIME;
            index = 0;
        }
    }

    if(status & EUSCI_A_UART_TRANSMIT_INTERRUPT)
    {
        if(TxDone != true)
        {
            //printDebugString("TX Cmd Sent\n\r");
            TxDataLen--;
            uint8_t dataByte = GetUARTData();
            //printDebugInt(dataByte);
            MAP_UART_transmitData(EUSCI_A2_BASE, dataByte);
            TxDone = true;
        }
        else
        {
            //printDebugString("TX Data Sent\n\r");
            //polling_delay_ms(7); //wait for CC to wake and stabilize UART
            GPIO_setOutputLowOnPin(CC_INT_PORT, CC_INT_PIN);
            GPIO_enableInterrupt(BUTTON1_PORT, BUTTON1_PIN);
        }
    }
}

void initUART(void)
{
    /* Selecting P3.2/PM_UCA2RXD/PM_UCA2SOMI and P3.3/PM_UCA2TXD/PM_UCA2SIMO in UART mode */
    MAP_GPIO_setAsPeripheralModuleFunctionInputPin(GPIO_PORT_P3,
            GPIO_PIN2 | GPIO_PIN3, GPIO_PRIMARY_MODULE_FUNCTION);

    //![Simple UART Example]
    /* Configuring UART Module */
    MAP_UART_initModule(EUSCI_A2_BASE, &uartConfig);

    /* Enable UART module */
    MAP_UART_enableModule(EUSCI_A2_BASE);

    /* Enabling interrupts */
    MAP_UART_enableInterrupt(EUSCI_A2_BASE, EUSCI_A_UART_RECEIVE_INTERRUPT | EUSCI_A_UART_TRANSMIT_INTERRUPT);
    MAP_Interrupt_enableInterrupt(INT_EUSCIA2);
    GPIO_setOutputLowOnPin(CC_INT_PORT, CC_INT_PIN);
}

uint8_t GetUARTData()
{
    if(TxDataLen == sizeof(txData))
        return txData.command;
    else
        return txData.data;
}

void SendUARTCmd(uint8_t* data, uint8_t len)
{
    TxDone = false;
    GPIO_setOutputHighOnPin(CC_INT_PORT, CC_INT_PIN);
    polling_delay_ms(7); //wait for CC to wake and stabilize UART
    TxDataLen = len;
    uint8_t dataByte = GetUARTData();
    //printDebugInt(dataByte);
    MAP_UART_transmitData(EUSCI_A2_BASE, dataByte);
}

void buttonIntHandler(void)
{
    GPIO_disableInterrupt(BUTTON1_PORT, BUTTON1_PIN);
    printDebugString("Button Pressed!\n\r");
    GPIO_clearInterruptFlag(BUTTON1_PORT, BUTTON1_PIN);

    txData.command = 0x00;
    txData.data = 0x01;
    SendUARTCmd(&txData, sizeof(txData));
}

uint32_t sysTickCount = 0;
/*
 * SysTick interrupt handler. This handler toggles HEARTBEAT LED on/off.
 */
void SysTick_Handler(void)
{
    sysTickCount++;
    GPIO_toggleOutputOnPin(HEARTBEAT_PORT, HEARTBEAT_PIN);
}

uint16_t xSum, ySum;

void polling_delay_ms(uint16_t millis)
{
    uint32_t i,j = 0;
    uint32_t time = 120000;

    //for(j = 0; j < millis; j++)
    {
        for(i = 0; i < (time*millis); i++)
        {
            ;
        }
    }
}

enum UART_CMD
{
    BUTTON_CMD,
    ALARM_CMD,
    TIME_HOUR_CMD,
    TIME_MIN_CMD
};

void main(void)
{
    int16_t ulIdx;
    WDT_A_hold(__WDT_A_BASE__);
    MAP_Interrupt_disableMaster();

    /* Initialize the demo. */
    boardInit();
    clockInit();
    initializeDemoButtons();

    polling_delay_ms(64);
    //
    // Configure the pins that connect to the LCD as GPIO outputs.
    //
    GPIO_setAsOutputPin(CC_INT_PORT, CC_INT_PIN);
    GPIO_setOutputLowOnPin(CC_INT_PORT, CC_INT_PIN);

    GPIO_setAsOutputPin(HEARTBEAT_PORT, HEARTBEAT_PIN);
    GPIO_setOutputLowOnPin(HEARTBEAT_PORT, HEARTBEAT_PIN);

    GPIO_toggleOutputOnPin(HEARTBEAT_PORT, HEARTBEAT_PIN);

    //setup S1 Left Button GPIO
    GPIO_setAsInputPinWithPullUpResistor(BUTTON1_PORT, BUTTON1_PIN);
    MAP_GPIO_clearInterruptFlag(GPIO_PORT_P1, GPIO_PIN1);
    GPIO_interruptEdgeSelect(BUTTON1_PORT, BUTTON1_PIN, GPIO_HIGH_TO_LOW_TRANSITION);
    GPIO_registerInterrupt(BUTTON1_PORT, buttonIntHandler);
    GPIO_enableInterrupt(BUTTON1_PORT, BUTTON1_PIN);

    MAP_SysTick_setPeriod(12000000);
    MAP_SysTick_enableModule();

    initUART();         //9600baud 8N1
    initUART0Debug();   //921600baud 8N1

    //MAP_Interrupt_enableSleepOnIsrExit();

    /* Globally enable interrupts. */
    MAP_Interrupt_enableMaster();
    MAP_SysTick_enableInterrupt();

    // LCD setup using Graphics Library API calls
    Kitronix320x240x16_SSD2119Init();
    Graphics_initContext(&g_sContext, &g_sKitronix320x240x16_SSD2119);
    Graphics_setBackgroundColor(&g_sContext, GRAPHICS_COLOR_BLACK);
    Graphics_setFont(&g_sContext, &g_sFontCmss36b);
    Graphics_clearDisplay(&g_sContext);

    touch_initInterface();

    drawMainMenu();

    printDebugString("Hello World!\n\r");
/*
    while(1)
    {
        MAP_PCM_gotoLPM0();
    }
*/

    // Loop to detect touch
    while(1)
    {
        /* Wait for a touch to be detected and wait ~4ms. */
        while(!touch_detectedTouch())
        {
            ;
        }
        touch_delay();

        /* Sample the X and Y measurements of the touch screen. */
        xSum = touch_sampleX();
        ySum = touch_sampleY();

        if(xSum > 1024)
        {
            memset(bufferTouch, 0, DEBUG_BUFFER_SIZE);
            ltoa(xSum, bufferTouch);
            uint8_t strLenX = strlen(bufferTouch);
            bufferTouch[strLenX] = ',';
            ltoa(ySum,(&bufferTouch[strLenX+1]));
            uint8_t strLen = strlen(bufferTouch);
            bufferTouch[strLen] = '\n';
            bufferTouch[strLen+1] = '\r';
            bufferTouch[strLen+2] = 0;
            //ltoa(ySum,(bufferTouch+strLen+1));
            //printDebugString("Touched: ");
            printDebugString(bufferTouch);

            if(ySum < 4600)
            {
                printDebugString("Touched Min!");
                txData.command = TIME_MIN_CMD;
                txData.data = 0x00;
                SendUARTCmd(&txData, sizeof(txData));
            }
            else if(ySum < 7600)
            {
                printDebugString("Touched Hour!");
                txData.command = TIME_HOUR_CMD;
                txData.data = 0x00;
                SendUARTCmd(&txData, sizeof(txData));
            }
            else
            {
                for(ulIdx=0; ulIdx<6; ulIdx++)
                {
                    if(xSum <= athanThreshold[ulIdx])
                    {
                        printDebugInt(ulIdx);
                        printDebugString(arr[ulIdx]);
                        if(athanDescColor[ulIdx] == GRAPHICS_COLOR_GREEN)
                        {
                            athanDescColor[ulIdx] = GRAPHICS_COLOR_GRAY;
                            alarmState = (alarmState & ~(1<<ulIdx)); //clear bit
                            txData.command = ALARM_CMD;
                            txData.data = alarmState;
                            SendUARTCmd(&txData, sizeof(txData));
                        }
                        else
                        {
                            athanDescColor[ulIdx] = GRAPHICS_COLOR_GREEN;
                            alarmState = (alarmState | (1<<ulIdx)); //set bit
                            txData.command = ALARM_CMD;
                            txData.data = alarmState;
                            SendUARTCmd(&txData, sizeof(txData));
                        }

                        drawMainMenu();
                        break;
                    }
                }
            }
        }

